In [1]:
import pandas as pd
csv_path="C:\\Users\\ARNOB\\Desktop\\hmp.csv"
df=pd.read_csv(csv_path)
df.head()

,Acc.1,Acc.2,Acc.3,Timestamp with Entry,Activity
0,22,49,35,Accelerometer-2011-04-11-13-28-18-brush_teeth-...,Brush_teeth
1,22,49,35,Accelerometer-2011-04-11-13-28-18-brush_teeth-...,Brush_teeth
2,22,52,35,Accelerometer-2011-04-11-13-28-18-brush_teeth-...,Brush_teeth
3,22,52,35,Accelerometer-2011-04-11-13-28-18-brush_teeth-...,Brush_teeth
4,21,52,34,Accelerometer-2011-04-11-13-28-18-brush_teeth-...,Brush_teeth

In [2]:
df.shape

(446529, 5)

In [3]:
df.size

2232645

In [4]:
df.index

RangeIndex(start=0, stop=446529, step=1)

In [5]:
#Note that datasets are probably to be created as dictionary
songs={'Album':['Thriller','Back in Black','The Dark Side of the Moon','The Bodyguard','Bat Out of Hell'],'Released':[1982,1980,1973,1992,1997],'Length':['00:42:19','00:42:11','00:42:49','00:57:44','00:46:33']}
songs_frame=pd.DataFrame(songs)
songs_frame.head()

                       Album  Released    Length
0                   Thriller      1982  00:42:19
1              Back in Black      1980  00:42:11
2  The Dark Side of the Moon      1973  00:42:49
3              The Bodyguard      1992  00:57:44
4            Bat Out of Hell      1997  00:46:33

In [6]:
x=df[['Acc.1']]
y=df[['Acc.1','Acc.2','Acc.3']]

In [7]:
x.head()

   Acc.1
0     22
1     22
2     22
3     22
4     21

In [8]:
y.head()

   Acc.1  Acc.2  Acc.3
0     22     49     35
1     22     49     35
2     22     52     35
3     22     52     35
4     21     52     34

In [22]:
# its better to access cells manually with .loc[row number,column name] and .iloc[row number,column number] .ix is a hot mess
df.iloc[0,0]

22

In [23]:
df.loc[0,'Acc.1']

22

In [25]:
# now for arrays
df.iloc[0:4,0:2]

   Acc.1  Acc.2
0     22     49
1     22     49
2     22     52
3     22     52

In [26]:
df.loc[0:4,'Acc.1':'Acc.3']

   Acc.1  Acc.2  Acc.3
0     22     49     35
1     22     49     35
2     22     52     35
3     22     52     35
4     21     52     34

In [27]:
#Review problems
import pandas as banana

df=banana.DataFrame({'a':[11,21,31],'b':[21,22,23]})

df.head()

    a   b
0  11  21
1  21  22
2  31  23